validacao/results/xvwa/dobotshield/06_wrk.log
=== wrk | xvwa/dobotshield | https://172.18.0.10:443/xvwa/ | 17/07/2026 23:39:00,91 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.10:443/xvwa/
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ https://172.18.0.10:443/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.11s     1.32s    5.00s    62.23%
    Req/Sec    15.36     12.19    90.00     74.00%
  Latency Distribution
     50%    1.67s 
     75%    3.25s 
     90%    4.13s 
     99%    4.83s 
  4283 requests in 30.09s, 45.38MB read
  Socket errors: connect 0, read 0, write 0, timeout 296
Requests/sec:    142.34
Transfer/sec:      1.51MB
RUN_RC=0

TOOL_RC=0